; domain
(define (domain depotprob1818-domain)
 (:requirements :strips :typing)
 (:types
    place locatable - object
    truck hoist surface - locatable
    pallet crate - surface
    depot distributor - place
 )
 (:predicates (at_ ?x - locatable ?y - place) (on ?x_0 - crate ?y_0 - surface) (in ?x_0 - crate ?y_1 - truck) (lifting ?x_1 - hoist ?y_2 - crate) (available ?x_1 - hoist) (clear ?x_2 - surface))
 (:action drive
  :parameters ( ?x_3 - truck ?y - place ?z - place)
  :precondition (and (at_ ?x_3 ?y))
  :effect (and (not (at_ ?x_3 ?y)) (at_ ?x_3 ?z)))
 (:action lift
  :parameters ( ?x_1 - hoist ?y_2 - crate ?z_0 - surface ?p - place)
  :precondition (and (at_ ?x_1 ?p) (available ?x_1) (at_ ?y_2 ?p) (on ?y_2 ?z_0) (clear ?y_2))
  :effect (and (not (at_ ?y_2 ?p)) (lifting ?x_1 ?y_2) (not (clear ?y_2)) (not (available ?x_1)) (clear ?z_0) (not (on ?y_2 ?z_0))))
 (:action drop
  :parameters ( ?x_1 - hoist ?y_2 - crate ?z_0 - surface ?p - place)
  :precondition (and (at_ ?x_1 ?p) (at_ ?z_0 ?p) (clear ?z_0) (lifting ?x_1 ?y_2))
  :effect (and (available ?x_1) (not (lifting ?x_1 ?y_2)) (at_ ?y_2 ?p) (not (clear ?z_0)) (clear ?y_2) (on ?y_2 ?z_0)))
 (:action load
  :parameters ( ?x_1 - hoist ?y_2 - crate ?z_1 - truck ?p - place)
  :precondition (and (at_ ?x_1 ?p) (at_ ?z_1 ?p) (lifting ?x_1 ?y_2))
  :effect (and (not (lifting ?x_1 ?y_2)) (in ?y_2 ?z_1) (available ?x_1)))
 (:action unload
  :parameters ( ?x_1 - hoist ?y_2 - crate ?z_1 - truck ?p - place)
  :precondition (and (at_ ?x_1 ?p) (at_ ?z_1 ?p) (available ?x_1) (in ?y_2 ?z_1))
  :effect (and (not (in ?y_2 ?z_1)) (not (available ?x_1)) (lifting ?x_1 ?y_2)))
)

; problem
(define (problem depotprob1818-problem)
 (:domain depotprob1818-domain)
 (:objects
   depot0 - depot
   distributor0 distributor1 - distributor
   truck0 truck1 - truck
   hoist0 hoist1 hoist2 - hoist
   pallet0 pallet1 pallet2 - pallet
   crate0 crate1 - crate
 )
 (:init (at_ pallet0 depot0) (clear crate1) (at_ pallet1 distributor0) (clear crate0) (at_ pallet2 distributor1) (clear pallet2) (at_ truck0 distributor1) (at_ truck1 depot0) (at_ hoist0 depot0) (available hoist0) (at_ hoist1 distributor0) (available hoist1) (at_ hoist2 distributor1) (available hoist2) (at_ crate0 distributor0) (on crate0 pallet1) (at_ crate1 depot0) (on crate1 pallet0))
 (:goal (and (on crate0 pallet2) (on crate1 pallet1)))
)

; plan
1. (lift hoist0 crate1 pallet0 depot0)
   deleted: (at_ crate1 depot0) (clear crate1) (available hoist0) (on crate1 pallet0)
   added: (lifting hoist0 crate1) (clear pallet0)
   goals met: 0 of 2
2. (load hoist0 crate1 truck1 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck1) (available hoist0)
   goals met: 0 of 2
3. (drive truck1 depot0 distributor0)
   deleted: (at_ truck1 depot0)
   added: (at_ truck1 distributor0)
   goals met: 0 of 2
4. (lift hoist1 crate0 pallet1 distributor0)
   deleted: (at_ crate0 distributor0) (clear crate0) (available hoist1) (on crate0 pallet1)
   added: (lifting hoist1 crate0) (clear pallet1)
   goals met: 0 of 2
5. (load hoist1 crate0 truck1 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck1) (available hoist1)
   goals met: 0 of 2
6. (unload hoist1 crate1 truck1 distributor0)
   deleted: (in crate1 truck1) (available hoist1)
   added: (lifting hoist1 crate1)
   goals met: 0 of 2
7. (drive truck1 distributor0 distributor1)
   deleted: (at_ truck1 distributor0)
   added: (at_ truck1 distributor1)
   goals met: 0 of 2
8. (unload hoist2 crate0 truck1 distributor1)
   deleted: (in crate0 truck1) (available hoist2)
   added: (lifting hoist2 crate0)
   goals met: 0 of 2
9. (drop hoist1 crate1 pallet1 distributor0)
   deleted: (lifting hoist1 crate1) (clear pallet1)
   added: (available hoist1) (at_ crate1 distributor0) (clear crate1) (on crate1 pallet1)
   goals met: 1 of 2
10. (drop hoist2 crate0 pallet2 distributor1)
   deleted: (lifting hoist2 crate0) (clear pallet2)
   added: (available hoist2) (at_ crate0 distributor1) (clear crate0) (on crate0 pallet2)
   goals met: 2 of 2
